Revit 2024 API
FailuresProcessingEventArgs.GetFailuresAccessor Method
 Provides access to the failure information in the document.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public FailuresAccessor GetFailuresAccessor()
Visual Basic
Public Function GetFailuresAccessor As FailuresAccessor
Visual C++
public:
FailuresAccessor^ GetFailuresAccessor()
Return Value
 The accessor to the failures in the document.
See Also
FailuresProcessingEventArgs Class
Autodesk.Revit.DB.Events Namespace